app/controllers/tweets_controller.rb

    def index
        @tweets = Tweet.all
---
SELECT `tweets`.* FROM `tweets`

    def create
        tweet = Tweet.new(tweet_params)
        if tweet.save
---
INSERT INTO `tweets` (`body`, `created_at`, `updated_at`) VALUES ('あびすあべば', '2020-12-21 11:30:45.056158', '2020-12-21 11:30:45.056158')

      def show
        @tweet = Tweet.find(params[:id])
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1

      def edit
        @tweet = Tweet.find(params[:id])
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1

      def update
        tweet = Tweet.find(params[:id])
        if tweet.update(tweet_params)
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
UPDATE `tweets` SET `tweets`.`body` = 'ところてんのすけ', `tweets`.`updated_at` = '2020-12-21 11:55:52.195951' WHERE `tweets`.`id` = 1